vortexmakes/RKH/demo/cross/shared/platform/s08/rkhs/demoqe128/cw_v10/prj/shared_dqe_s08qe128/Project_Headers/mc9s08qe128.h
    /*** TPM3C0VL - TPM3 Timer Channel 0 Value Register Low; 0x00000067 ***/
    union {
      byte Byte;
    } TPM3C0VLSTR;
    #define TPM3C0VL                    _TPM3C0V.Overlap_STR.TPM3C0VLSTR.Byte
    
  } Overlap_STR;

} TPM3C0VSTR;
extern volatile TPM3C0VSTR _TPM3C0V @0x00000066;
#define TPM3C0V                         _TPM3C0V.Word


/*** TPM3C1SC - TPM3 Timer Channel 1 Status and Control Register; 0x00000068 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte ELS1A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS1B       :1;                                       /* Edge/Level Select Bit B */
    byte MS1A        :1;                                       /* Mode Select A for TPM Channel 1 */
    byte MS1B        :1;                                       /* Mode Select B for TPM Channel 1 */
    byte CH1IE       :1;                                       /* Channel 1 Interrupt Enable */
    byte CH1F        :1;                                       /* Channel 1 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS1x :2;
    byte grpMS1x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM3C1SCSTR;
extern volatile TPM3C1SCSTR _TPM3C1SC @0x00000068;
#define TPM3C1SC                        _TPM3C1SC.Byte
#define TPM3C1SC_ELS1A                  _TPM3C1SC.Bits.ELS1A
#define TPM3C1SC_ELS1B                  _TPM3C1SC.Bits.ELS1B
#define TPM3C1SC_MS1A                   _TPM3C1SC.Bits.MS1A
#define TPM3C1SC_MS1B                   _TPM3C1SC.Bits.MS1B
#define TPM3C1SC_CH1IE                  _TPM3C1SC.Bits.CH1IE
#define TPM3C1SC_CH1F                   _TPM3C1SC.Bits.CH1F
#define TPM3C1SC_ELS1x                  _TPM3C1SC.MergedBits.grpELS1x
#define TPM3C1SC_MS1x                   _TPM3C1SC.MergedBits.grpMS1x

#define TPM3C1SC_ELS1A_MASK             4U
#define TPM3C1SC_ELS1B_MASK             8U
#define TPM3C1SC_MS1A_MASK              16U
#define TPM3C1SC_MS1B_MASK              32U
#define TPM3C1SC_CH1IE_MASK             64U
#define TPM3C1SC_CH1F_MASK              128U
#define TPM3C1SC_ELS1x_MASK             12U
#define TPM3C1SC_ELS1x_BITNUM           2U
#define TPM3C1SC_MS1x_MASK              48U
#define TPM3C1SC_MS1x_BITNUM            4U


/*** TPM3C1V - TPM3 Timer Channel 1 Value Register; 0x00000069 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM3C1VH - TPM3 Timer Channel 1 Value Register High; 0x00000069 ***/
    union {
      byte Byte;
    } TPM3C1VHSTR;
    #define TPM3C1VH                    _TPM3C1V.Overlap_STR.TPM3C1VHSTR.Byte
    

    /*** TPM3C1VL - TPM3 Timer Channel 1 Value Register Low; 0x0000006A ***/
    union {
      byte Byte;
    } TPM3C1VLSTR;
    #define TPM3C1VL                    _TPM3C1V.Overlap_STR.TPM3C1VLSTR.Byte
    
  } Overlap_STR;

} TPM3C1VSTR;
extern volatile TPM3C1VSTR _TPM3C1V @0x00000069;
#define TPM3C1V                         _TPM3C1V.Word


/*** TPM3C2SC - TPM3 Timer Channel 2 Status and Control Register; 0x0000006B ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte ELS2A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS2B       :1;                                       /* Edge/Level Select Bit B */
    byte MS2A        :1;                                       /* Mode Select A for TPM Channel 2 */
    byte MS2B        :1;                                       /* Mode Select B for TPM Channel 2 */
    byte CH2IE       :1;                                       /* Channel 2 Interrupt Enable */
    byte CH2F        :1;                                       /* Channel 2 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS2x :2;
    byte grpMS2x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM3C2SCSTR;
extern volatile TPM3C2SCSTR _TPM3C2SC @0x0000006B;
#define TPM3C2SC                        _TPM3C2SC.Byte
#define TPM3C2SC_ELS2A                  _TPM3C2SC.Bits.ELS2A
#define TPM3C2SC_ELS2B                  _TPM3C2SC.Bits.ELS2B
#define TPM3C2SC_MS2A                   _TPM3C2SC.Bits.MS2A
#define TPM3C2SC_MS2B                   _TPM3C2SC.Bits.MS2B
#define TPM3C2SC_CH2IE                  _TPM3C2SC.Bits.CH2IE
#define TPM3C2SC_CH2F                   _TPM3C2SC.Bits.CH2F
#define TPM3C2SC_ELS2x                  _TPM3C2SC.MergedBits.grpELS2x
#define TPM3C2SC_MS2x                   _TPM3C2SC.MergedBits.grpMS2x

#define TPM3C2SC_ELS2A_MASK             4U
#define TPM3C2SC_ELS2B_MASK             8U
#define TPM3C2SC_MS2A_MASK              16U
#define TPM3C2SC_MS2B_MASK              32U
#define TPM3C2SC_CH2IE_MASK             64U
#define TPM3C2SC_CH2F_MASK              128U
#define TPM3C2SC_ELS2x_MASK             12U
#define TPM3C2SC_ELS2x_BITNUM           2U
#define TPM3C2SC_MS2x_MASK              48U
#define TPM3C2SC_MS2x_BITNUM            4U


/*** TPM3C2V - TPM3 Timer Channel 2 Value Register; 0x0000006C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM3C2VH - TPM3 Timer Channel 2 Value Register High; 0x0000006C ***/
    union {
      byte Byte;
    } TPM3C2VHSTR;
    #define TPM3C2VH                    _TPM3C2V.Overlap_STR.TPM3C2VHSTR.Byte
    

    /*** TPM3C2VL - TPM3 Timer Channel 2 Value Register Low; 0x0000006D ***/
    union {
      byte Byte;
    } TPM3C2VLSTR;
    #define TPM3C2VL                    _TPM3C2V.Overlap_STR.TPM3C2VLSTR.Byte
    
  } Overlap_STR;

} TPM3C2VSTR;
extern volatile TPM3C2VSTR _TPM3C2V @0x0000006C;
#define TPM3C2V                         _TPM3C2V.Word


/*** TPM3C3SC - TPM3 Timer Channel 3 Status and Control Register; 0x0000006E ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte ELS3A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS3B       :1;                                       /* Edge/Level Select Bit B */
    byte MS3A        :1;                                       /* Mode Select A for TPM Channel 3 */
    byte MS3B        :1;                                       /* Mode Select B for TPM Channel 3 */
    byte CH3IE       :1;                                       /* Channel 3 Interrupt Enable */
    byte CH3F        :1;                                       /* Channel 3 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS3x :2;
    byte grpMS3x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM3C3SCSTR;
extern volatile TPM3C3SCSTR _TPM3C3SC @0x0000006E;
#define TPM3C3SC                        _TPM3C3SC.Byte
#define TPM3C3SC_ELS3A                  _TPM3C3SC.Bits.ELS3A
#define TPM3C3SC_ELS3B                  _TPM3C3SC.Bits.ELS3B
#define TPM3C3SC_MS3A                   _TPM3C3SC.Bits.MS3A
#define TPM3C3SC_MS3B                   _TPM3C3SC.Bits.MS3B
#define TPM3C3SC_CH3IE                  _TPM3C3SC.Bits.CH3IE
#define TPM3C3SC_CH3F                   _TPM3C3SC.Bits.CH3F
#define TPM3C3SC_ELS3x                  _TPM3C3SC.MergedBits.grpELS3x
#define TPM3C3SC_MS3x                   _TPM3C3SC.MergedBits.grpMS3x

